{"format": "layers-model", "generatedBy": "keras v2.6.0", "convertedBy": "TensorFlow.js Converter v3.9.0", "modelTopology": {"keras_version": "2.6.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null], "dtype": "string", "sparse": false, "ragged": false, "name": "keras_layer_input"}}, {"class_name": "KerasLayer", "config": {"name": "keras_layer", "trainable": false, "batch_input_shape": [null], "dtype": "string", "handle": "https://tfhub.dev/google/universal-sentence-encoder/4"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}]], "loss_weights": null, "sample_weight_mode": null, "weighted_metrics": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of245.bin", "group1-shard2of245.bin", "group1-shard3of245.bin", "group1-shard4of245.bin", "group1-shard5of245.bin", "group1-shard6of245.bin", "group1-shard7of245.bin", "group1-shard8of245.bin", "group1-shard9of245.bin", "group1-shard10of245.bin", "group1-shard11of245.bin", "group1-shard12of245.bin", "group1-shard13of245.bin", "group1-shard14of245.bin", "group1-shard15of245.bin", "group1-shard16of245.bin", "group1-shard17of245.bin", "group1-shard18of245.bin", "group1-shard19of245.bin", "group1-shard20of245.bin", "group1-shard21of245.bin", "group1-shard22of245.bin", "group1-shard23of245.bin", "group1-shard24of245.bin", "group1-shard25of245.bin", "group1-shard26of245.bin", "group1-shard27of245.bin", "group1-shard28of245.bin", "group1-shard29of245.bin", "group1-shard30of245.bin", "group1-shard31of245.bin", "group1-shard32of245.bin", "group1-shard33of245.bin", "group1-shard34of245.bin", "group1-shard35of245.bin", "group1-shard36of245.bin", "group1-shard37of245.bin", "group1-shard38of245.bin", "group1-shard39of245.bin", "group1-shard40of245.bin", "group1-shard41of245.bin", "group1-shard42of245.bin", "group1-shard43of245.bin", "group1-shard44of245.bin", "group1-shard45of245.bin", "group1-shard46of245.bin", "group1-shard47of245.bin", "group1-shard48of245.bin", "group1-shard49of245.bin", "group1-shard50of245.bin", "group1-shard51of245.bin", "group1-shard52of245.bin", "group1-shard53of245.bin", "group1-shard54of245.bin", "group1-shard55of245.bin", "group1-shard56of245.bin", "group1-shard57of245.bin", "group1-shard58of245.bin", "group1-shard59of245.bin", "group1-shard60of245.bin", "group1-shard61of245.bin", "group1-shard62of245.bin", "group1-shard63of245.bin", "group1-shard64of245.bin", "group1-shard65of245.bin", "group1-shard66of245.bin", "group1-shard67of245.bin", "group1-shard68of245.bin", "group1-shard69of245.bin", "group1-shard70of245.bin", "group1-shard71of245.bin", "group1-shard72of245.bin", "group1-shard73of245.bin", "group1-shard74of245.bin", "group1-shard75of245.bin", "group1-shard76of245.bin", "group1-shard77of245.bin", "group1-shard78of245.bin", "group1-shard79of245.bin", "group1-shard80of245.bin", "group1-shard81of245.bin", "group1-shard82of245.bin", "group1-shard83of245.bin", "group1-shard84of245.bin", "group1-shard85of245.bin", "group1-shard86of245.bin", "group1-shard87of245.bin", "group1-shard88of245.bin", "group1-shard89of245.bin", "group1-shard90of245.bin", "group1-shard91of245.bin", "group1-shard92of245.bin", "group1-shard93of245.bin", "group1-shard94of245.bin", "group1-shard95of245.bin", "group1-shard96of245.bin", "group1-shard97of245.bin", "group1-shard98of245.bin", "group1-shard99of245.bin", "group1-shard100of245.bin", "group1-shard101of245.bin", "group1-shard102of245.bin", "group1-shard103of245.bin", "group1-shard104of245.bin", "group1-shard105of245.bin", "group1-shard106of245.bin", "group1-shard107of245.bin", "group1-shard108of245.bin", "group1-shard109of245.bin", "group1-shard110of245.bin", "group1-shard111of245.bin", "group1-shard112of245.bin", "group1-shard113of245.bin", "group1-shard114of245.bin", "group1-shard115of245.bin", "group1-shard116of245.bin", "group1-shard117of245.bin", "group1-shard118of245.bin", "group1-shard119of245.bin", "group1-shard120of245.bin", "group1-shard121of245.bin", "group1-shard122of245.bin", "group1-shard123of245.bin", "group1-shard124of245.bin", "group1-shard125of245.bin", "group1-shard126of245.bin", "group1-shard127of245.bin", "group1-shard128of245.bin", "group1-shard129of245.bin", "group1-shard130of245.bin", "group1-shard131of245.bin", "group1-shard132of245.bin", "group1-shard133of245.bin", "group1-shard134of245.bin", "group1-shard135of245.bin", "group1-shard136of245.bin", "group1-shard137of245.bin", "group1-shard138of245.bin", "group1-shard139of245.bin", "group1-shard140of245.bin", "group1-shard141of245.bin", "group1-shard142of245.bin", "group1-shard143of245.bin", "group1-shard144of245.bin", "group1-shard145of245.bin", "group1-shard146of245.bin", "group1-shard147of245.bin", "group1-shard148of245.bin", "group1-shard149of245.bin", "group1-shard150of245.bin", "group1-shard151of245.bin", "group1-shard152of245.bin", "group1-shard153of245.bin", "group1-shard154of245.bin", "group1-shard155of245.bin", "group1-shard156of245.bin", "group1-shard157of245.bin", "group1-shard158of245.bin", "group1-shard159of245.bin", "group1-shard160of245.bin", "group1-shard161of245.bin", "group1-shard162of245.bin", "group1-shard163of245.bin", "group1-shard164of245.bin", "group1-shard165of245.bin", "group1-shard166of245.bin", "group1-shard167of245.bin", "group1-shard168of245.bin", "group1-shard169of245.bin", "group1-shard170of245.bin", "group1-shard171of245.bin", "group1-shard172of245.bin", "group1-shard173of245.bin", "group1-shard174of245.bin", "group1-shard175of245.bin", "group1-shard176of245.bin", "group1-shard177of245.bin", "group1-shard178of245.bin", "group1-shard179of245.bin", "group1-shard180of245.bin", "group1-shard181of245.bin", "group1-shard182of245.bin", "group1-shard183of245.bin", "group1-shard184of245.bin", "group1-shard185of245.bin", "group1-shard186of245.bin", "group1-shard187of245.bin", "group1-shard188of245.bin", "group1-shard189of245.bin", "group1-shard190of245.bin", "group1-shard191of245.bin", "group1-shard192of245.bin", "group1-shard193of245.bin", "group1-shard194of245.bin", "group1-shard195of245.bin", "group1-shard196of245.bin", "group1-shard197of245.bin", "group1-shard198of245.bin", "group1-shard199of245.bin", "group1-shard200of245.bin", "group1-shard201of245.bin", "group1-shard202of245.bin", "group1-shard203of245.bin", "group1-shard204of245.bin", "group1-shard205of245.bin", "group1-shard206of245.bin", "group1-shard207of245.bin", "group1-shard208of245.bin", "group1-shard209of245.bin", "group1-shard210of245.bin", "group1-shard211of245.bin", "group1-shard212of245.bin", "group1-shard213of245.bin", "group1-shard214of245.bin", "group1-shard215of245.bin", "group1-shard216of245.bin", "group1-shard217of245.bin", "group1-shard218of245.bin", "group1-shard219of245.bin", "group1-shard220of245.bin", "group1-shard221of245.bin", "group1-shard222of245.bin", "group1-shard223of245.bin", "group1-shard224of245.bin", "group1-shard225of245.bin", "group1-shard226of245.bin", "group1-shard227of245.bin", "group1-shard228of245.bin", "group1-shard229of245.bin", "group1-shard230of245.bin", "group1-shard231of245.bin", "group1-shard232of245.bin", "group1-shard233of245.bin", "group1-shard234of245.bin", "group1-shard235of245.bin", "group1-shard236of245.bin", "group1-shard237of245.bin", "group1-shard238of245.bin", "group1-shard239of245.bin", "group1-shard240of245.bin", "group1-shard241of245.bin", "group1-shard242of245.bin", "group1-shard243of245.bin", "group1-shard244of245.bin", "group1-shard245of245.bin"], "weights": [{"name": "dense/kernel", "shape": [512, 1], "dtype": "float32"}, {"name": "dense/bias", "shape": [1], "dtype": "float32"}, {"name": "Embeddings/sharded_0", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_1", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_2", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_3", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_4", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_5", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_6", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_7", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_8", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_9", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_10", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_11", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_12", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_13", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_14", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_15", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_16", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_17", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_18", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_19", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_20", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_21", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_22", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_23", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_24", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_25", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_26", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_27", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_28", "shape": [26667, 320], "dtype": "float32"}, {"name": "Embeddings/sharded_29", "shape": [26667, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_0", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_1", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_2", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_3", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_4", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_5", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_6", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_7", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_8", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_9", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_10", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_11", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_12", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_13", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_14", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_15", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_16", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_17", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_18", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_19", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_20", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_21", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_22", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_23", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_24", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_25", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_26", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_27", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_28", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_0/dense/kernel/part_29", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_0", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_1", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_2", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_3", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_4", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_5", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_6", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_7", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_8", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_9", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_10", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_11", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_12", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_13", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_14", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_15", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_16", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_17", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_18", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_19", "shape": [11, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_20", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_21", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_22", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_23", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_24", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_25", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_26", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_27", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_28", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_1/dense/kernel/part_29", "shape": [10, 320], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_0", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_1", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_2", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_3", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_4", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_5", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_6", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_7", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_8", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_9", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_10", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_11", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_12", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_13", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_14", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_15", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_16", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_17", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_18", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_19", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_20", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_21", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_22", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_23", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_24", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_25", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_26", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_27", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_28", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_2/dense/kernel/part_29", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_0", "shape": [18, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_1", "shape": [18, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_2", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_3", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_4", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_5", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_6", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_7", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_8", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_9", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_10", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_11", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_12", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_13", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_14", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_15", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_16", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_17", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_18", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_19", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_20", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_21", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_22", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_23", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_24", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_25", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_26", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_27", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_28", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/dense/kernel/part_29", "shape": [17, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_0", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_1", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_2", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_3", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_4", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_5", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_6", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_7", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_8", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_9", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_10", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_11", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_12", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_13", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_14", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_15", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_16", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_17", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_18", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_19", "shape": [11, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_20", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_21", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_22", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_23", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_24", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_25", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_26", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_27", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_28", "shape": [10, 512], "dtype": "float32"}, {"name": "EncoderDNN/DNN/ResidualHidden_3/AdjustDepth/projection/kernel/part_29", "shape": [10, 512], "dtype": "float32"}]}]}